Autodesk.Revit.DB.FabricationServiceSettings.HasValidFluidSetting(Autodesk.Revit.DB.FabricationService)
Is the service associated with a fluid type and temperature?
service:
The service to lookup.
Returns:
True if the service is associated with a fluid type and temperature, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FabricationServiceSettings.GetFluidType(Autodesk.Revit.DB.FabricationService)
Gets the fluid type of the specified service.
service:
The service to lookup.
Returns:
The fluid type id.
Throws Autodesk.Revit.Exceptions.ArgumentException:
service is not mapped to a fluid type and temperature.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FabricationServiceSettings.GetFluidTemperature(Autodesk.Revit.DB.FabricationService)
Gets the fluid temperature of the specified service.
service:
The service to lookup.
Returns:
The temperature in Kelvin.
Throws Autodesk.Revit.Exceptions.ArgumentException:
service is not mapped to a fluid type and temperature.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FabricationServiceSettings.RemoveFluidSetting(Autodesk.Revit.DB.FabricationService)
Clears the fluid setting of the specified service if found.
service:
The service to clear.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FabricationServiceSettings.SetFluidTypeAndTemperature(Autodesk.Revit.DB.FabricationService,Autodesk.Revit.DB.ElementId,System.Double)
Sets the fluid type and temperature of the specified service.
service:
The fabrication service to be set.
fluidId:
The fluid type id.
temperature:
The temperature in Kelvin.
Throws Autodesk.Revit.Exceptions.ArgumentException:
fluidId is not a fluid type.
-or-
The temperature is not defined for the fluidId fluid type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FabricationServiceSettings.GetFabricationServiceSettings(Autodesk.Revit.DB.Document)
Gets the settings element in the document.
doc:
The document where the settings element is found.
Returns:
The element which stores the fabrication service settings for the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.DB.FabricationServiceSettings.AirFluidType
A special fluid type for fabrication HVAC services.
Since:
2024

Autodesk.Revit.DB.FabricationServiceSettings
Represents the settings related to the fabrication services.
Since:
2024